modules/Core/Models/Settings.php

select * from `core_settings` group by `name`
---
    public static function getSettings($group = '',$locale = '')
    {
        if ($group) {
            static::where('group', $group);
        }
        $all = static::groupBy('name')->get();

select * from `core_settings` where `name` = 'hotel_review_number_per_page' limit 1
select * from `core_settings` where `name` = 'update_to_110' limit 1
---
    public static function item($item, $default = false)
    {

        $value = Cache::rememberForever('setting_' . $item, function () use ($item ,$default) {
            $val = Settings::where('name', $item)->first();
            return $val?$val['val']:'';
        });